posts/istio/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Istio | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/istio/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<link rel="prev" href="../ci-pipeline/" title="CI Pipeline" type="text/html">
<link rel="next" href="../general-notes-on-data-lakes/" title="General Notes on Data Lakes" type="text/html">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="Istio">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/istio/">
<meta property="og:description" content="A quick intro to Istio and what that is.



Expand in the future in case of need.






Service Mesh


A service mesh can help you solve the issues that arise when you’re
implementing a microservices ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-27T16:50:16+02:00">
<meta property="article:tag" content="Microservices">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="../../pages/foto-blog/" title="Foto Blog"><i class="fa fa-camera-retro"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Istio</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2021-05-27T16:50:16+02:00" itemprop="datePublished" title="2021-05-27 16:50">2021-05-27 16:50</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/microservices/" rel="tag">Microservices</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
A quick intro to Istio and what that is.
</p>

<p>
Expand in the future in case of need.
</p>

<!-- TEASER_END -->


<div id="outline-container-org09726ee" class="outline-2">
<h2 id="org09726ee">Service Mesh</h2>
<div class="outline-text-2" id="text-org09726ee">
<p>
A service mesh can help you solve the issues that arise when you’re
implementing a microservices app.
</p>

<p>
A service mesh comprehends the following components
</p>

<ul class="org-ul">
<li>A service registry

<ul class="org-ul">
<li>is used to keep track of the location and health of services, so a
requesting service can be directed to a provider service in a
reliable way.</li>

<li>is a simple key-value pair data store, maintaining a current list
of all working service instances and their locations. As each
service instance starts, it will register itself with the service
registry, either through its own client code or through a
third-party registrar function.</li>

<li>the service registry will use a heartbeat mechanism, either
in-bound or out-bound, to keep its list of instances current.</li>

<li>because of its centrality this needs to be made highly available
in some way.</li>
</ul>
</li>
</ul>
<ul class="org-ul">
<li>service discovery

<ul class="org-ul">
<li>depending on the overall design of the app, each service instance
can be either a service client, requesting data or functions from
other services, a service provider, providing data or functions to
service clients, or both. Whenever a service needs another
service, it uses the service discovery function to find an
instance of that service.</li>

<li>uses the service registry’s list of available services and
instances of those services, and it directs requests to the
appropriate instance based on pure load balancing or any other
rule that has been configured.</li>

<li>The first type of service discovery is <b>client-side
discovery</b>. Using this method, the requesting service, or service
client, works directly with the service registry to determine all
the available instances of the service it needs and is also
responsible for deciding which of those service instances it will
use for its request (no load balancing here).</li>

<li>
<p>
The second type of service discovery is called <b>server-side
discovery</b>. This method introduces another component, the
service-proxy in microservices language - a loadbalancer in
practice -.
</p>

<p>
The task of querying the service registry and directing a request
to the appropriate service instance is delegated to the load
balancer. In some implementations, such as Istio, the load
balancer can be programmed with specific rules to govern its
choice of service instance, beyond just using round-robin load
balancing.
</p>
</li>
</ul>
</li>
</ul>
<ul class="org-ul">
<li>testing facilities

<ul class="org-ul">
<li>This gives you the ability to simulate the failure or temporary
unavailability of one or more services in your app, and to make
sure the resiliency features that you designed will work to keep
the app functional.</li>

<li>microservices should be designed to run unreliable systems. You
should expect components to fail and build resiliency into your
apps such that they can withstand those failures. One of the basic
design points of this strategy is to always have <i>more than one
instance of any given service</i> so that your app can survive the
failure of a given instance and continue to function while that
instance is restarted.</li>
</ul>
</li>
</ul>
<ul class="org-ul">
<li>circuit breakers and bulkheads:

<ul class="org-ul">
<li>Two functions that can help to provide resiliency to the
application.</li>

<li>Circuit breakers work to prevent response delays from a given
service dependency caused by failure or latency, so that delays
don’t cause broader latencies and failures throughout the app. The
breaker allows you to set timeout thresholds and failure
thresholds that allow you to <b>fail fast</b> from such situations with
the expectation of building an alternative plan into your app.</li>

<li>The Bulkhead pattern is another tool included with Netflix Hystrix
that prevents response delays from a given service call from
causing wider problems throughout the app. This behavior is
accomplished by using separate thread pools for connection
attempts to other systems so that delays called by latency or
failure of a given service are isolated to that service and do not
use all the threads for the app as more requests are made.</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org96b8f64" class="outline-2">
<h2 id="org96b8f64">Istio</h2>
<div class="outline-text-2" id="text-org96b8f64">
<p>
Istio is an open platform service mesh implementation for connecting,
managing, and securing microservices.
</p>

<p>
You add Istio support to services by deploying a special sidecar proxy
throughout your environment that intercepts all network communication
among microservices, which is configured and managed using Istio’s
control plane functionality.
</p>

<p>
The idea of Istio is to allow a service mesh without requiring any
changes in service code.
</p>

<p>
Istio provides a complete solution to satisfy the diverse requirements
of microservice applications by providing behavioral insights and
operational control over the service mesh as a whole.
</p>

<p>
I.e. it addresses discovery, load balancing, failure recovery,
metrics, and monitoring, and often more complex operational
requirements such as A/B testing, canary releases, rate limiting,
access control, and end-to-end authentication.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../ci-pipeline/" rel="prev" title="CI Pipeline">Previous post</a>
            </li>
            <li class="next">
                <a href="../general-notes-on-data-lakes/" rel="next" title="General Notes on Data Lakes">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2022         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
